       identification division.
       program-id. Program1234567890.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program Program1234567890.